tutorials/fluidSolidInteraction/microBeamInCrossFlow/system/solid/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM GUI Project: creativeFields           |
|  \\    /   O peration     | Version:  0.8.9.0                              |
|   \\  /    A nd           | Web: www.c-fields.com                          |
|    \\/     M anipulation  |                                                |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2;
    format ascii;
    class dictionary;
    location "system";
    object meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxCellSize 1;

surfaceFile "microBeamInCrossFlow.solid.ftr";

localRefinement
{
    CreatedbyGmsh_1
    {
        cellSize 1;
    }
}

// boundaryLayers
// {
//     //nLayers         6;
//     //thicknessRatio  1.2;
//     patchBoundaryLayers
//     {
//         "CreatedbyGmsh_0|CreatedbyGmsh_1|CreatedbyGmsh_2|CreatedbyGmsh_4"
//         {
//             nLayers           4;
//             thicknessRatio    1.2;
//             //maxFirstLayerThickness 0.2;
//             //allowDiscontinuity 0;
//         }
//     }
// }

renameBoundary
{
    //defaultName fixedWalls;
    //defaultType wall;

    newPatchNames
    {
        CreatedbyGmsh_0
        {
            newName     interface;
            newType     patch;
        }
        CreatedbyGmsh_1
        {
            newName     fixed;
            newType     patch;
        }
        bottomEmptyFaces
        {
            newName     backPlane;
            newType     empty;
        }
        topEmptyFaces
        {
            newName     frontPlane;
            newType     empty;
        }
    }
}

// ************************************************************************* //
