tutorials/fluidSolidInteraction/microBeamInCrossFlow/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        //type            fixedValue;
        //value           uniform (3.5e-05 0 0);

        type            pulsedParabolicVelocity;
        steadyValue     0.05;
        t1              0.04;
        t2              0.1;
        n               (1 0 0);
        y               (0 1 0);
        transitionPeriod 0.01;
        boundBoxMin     (0 0 0);
        boundBoxMax     (0 0.0001 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    interface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
